In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [2]:
engine = create_engine('sqlite:///../data/raw/Albrodmar.db')

In [3]:
df_rank = pd.read_sql_query("SELECT * FROM rank_info", engine)

In [4]:
df_rank.describe()

                id     position   Unnamed: 0
count  2260.000000  2208.000000  2260.000000
mean   5535.364602  1104.500000  1129.500000
std    2573.014257   637.539018   652.550126
min    1000.000000     1.000000     0.000000
25%    3371.500000   552.750000   564.750000
50%    5547.500000  1104.500000  1129.500000
75%    7691.750000  1656.250000  1694.250000
max    9997.000000  2208.000000  2259.000000

In [5]:
df_rank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2260 entries, 0 to 2259
Data columns (total 4 columns):
id            2260 non-null int64
name          2260 non-null object
position      2208 non-null float64
Unnamed: 0    2260 non-null int64
dtypes: float64(1), int64(2), object(1)
memory usage: 70.8+ KB

In [6]:
df_rank.head()

     id                         name  position  Unnamed: 0
0  6514  ananT ASAVABHOKHIN & FAMIly       NaN           0
1  1255               arASH FERDOWsi       NaN           1
2  8837     bANTHOON LAMSAM & family       NaN           2
3  9740       bill ADDERLEY & FAmily       NaN           3
4  8031            boris zINGARevich       NaN           4

In [7]:
len(df_rank)

2260

In [9]:
df_rank.isnull().sum()

id             0
name           0
position      52
Unnamed: 0     0
dtype: int64

In [10]:
df_rank.shape

(2260, 4)

In [24]:
df_rank.dtypes

id              int64
name           object
position      float64
Unnamed: 0      int64
dtype: object

In [31]:
df_rank['name'] = df_rank['name'].str.title()
df_rank['name']

0       Anant Asavabhokhin & Family
1                    Arash Ferdowsi
2          Banthoon Lamsam & Family
3            Bill Adderley & Family
4                 Boris Zingarevich
                   ...
2255                 Zhao Xiaoqiang
2256                Zhou Liangzhang
2257                   Zhu Xingming
2258                       Zhuo Jun
2259                    Olgun Zorlu
Name: name, Length: 2260, dtype: object